user/tutorials/Nike/TemporalMixingLayer_s/0/vorticity
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      vorticity;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 0 0 0 0];

internalField   nonuniform List<vector> 
24576
(
(0 4.51103956942e-05 0)
(0 3.85461523024e-05 0)
(0 3.20770856702e-05 0)
(0 2.57650807208e-05 0)
(0 1.96712531809e-05 0)
(0 1.38541591135e-05 0)
(0 8.36978787718e-06 0)
(0 3.27123007135e-06 0)
...
)
;

boundaryField
{
    front
    {
        type            empty;
    }
    back
    {
        type            empty;
    }
    left
    {
        type            cyclic;
    }
    right
    {
        type            cyclic;
    }
    bottom
    {
        type            calculated;
        value           nonuniform List<vector> 
128
(
(0 -1.69722727854e-05 0)
(0 -5.07533661287e-05 0)
(0 -8.40456768167e-05 0)
(0 -0.000116528581673 0)
(0 -0.000147889252585 0)
(0 -0.000177825669154 0)
(0 -0.000206049527331 0)
(0 -0.000232289015912 0)
...
)
;
    }
    top
    {
        type            calculated;
        value           nonuniform List<vector> 
128
(
(0 -1.69722727854e-05 0)
(0 -5.07533661287e-05 0)
(0 -8.40456768167e-05 0)
(0 -0.000116528581673 0)
(0 -0.000147889252585 0)
(0 -0.000177825669154 0)
(0 -0.000206049527331 0)
(0 -0.000232289015912 0)
...
)
;
    }
}


// ************************************************************************* //
